app/controllers/books_controller.rb

  def create
    @user = current_user
    @book = Book.new(book_params)
    @book.user_id = current_user.id

    if @book.save
      flash[:notice] = "You have created book successfully."
      redirect_to book_path(@book.id)
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "bsg"], ["body", "zfxva"], ["user_id", 1], ["created_at", "2021-03-01 11:50:59.096437"], ["updated_at", "2021-03-01 11:50:59.096437"]]
SELECT "books".* FROM "books"